{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Merge", "config": {"mode": "concat", "output_shape_type": "raw", "dot_axes": -1, "output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "activation": "linear", "bias": true, "batch_input_shape": [null, 142, 170, 3], "border_mode": "valid", "nb_filter": 32, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "name": "convolution2d_1", "b_constraint": null, "input_dtype": "float32", "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "activation": "linear", "bias": true, "border_mode": "valid", "nb_filter": 32, "subsample": [1, 1], "trainable": true, "name": "convolution2d_2", "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "activation": "linear", "bias": true, "border_mode": "valid", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "name": "convolution2d_3", "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_regularizer": null, "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "activation": "linear", "bias": true, "border_mode": "valid", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "name": "convolution2d_4", "b_constraint": null, "W_regularizer": null, "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 79872, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "output_dim": 128, "activation": "linear", "bias": true, "W_constraint": null, "trainable": true, "name": "dense_2", "b_constraint": null, "W_regularizer": null}}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeatvector_1", "n": 67}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 172, "init": "uniform", "activity_regularizer": null, "output_dim": 256, "input_dtype": "int32", "input_length": 67, "batch_input_shape": [null, 67], "mask_zero": false, "W_constraint": null, "dropout": 0.0, "trainable": true, "name": "embedding_1", "W_regularizer": null}}, {"class_name": "LSTM", "config": {"input_dim": 256, "init": "glorot_uniform", "b_regularizer": null, "forget_bias_init": "one", "output_dim": 128, "consume_less": "cpu", "activation": "tanh", "U_regularizer": null, "inner_activation": "hard_sigmoid", "input_length": null, "dropout_W": 0.0, "inner_init": "orthogonal", "go_backwards": false, "unroll": false, "return_sequences": true, "trainable": true, "name": "lstm_1", "stateful": false, "W_regularizer": null, "dropout_U": 0.0}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "timedistributed_1", "layer": {"class_name": "Dense", "config": {"input_dim": 128, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "output_dim": 128, "activation": "linear", "bias": true, "W_constraint": null, "trainable": true, "name": "dense_1", "b_constraint": null, "W_regularizer": null}}}}]}], "output_mask_type": "raw", "name": "merge_1", "concat_axis": -1, "output_mask": null, "arguments": {}, "mode_type": "raw"}}, {"class_name": "LSTM", "config": {"input_dim": 256, "init": "glorot_uniform", "unroll": false, "b_regularizer": null, "forget_bias_init": "one", "output_dim": 256, "trainable": true, "activation": "tanh", "U_regularizer": null, "inner_activation": "hard_sigmoid", "input_length": null, "dropout_W": 0.0, "inner_init": "orthogonal", "go_backwards": false, "consume_less": "cpu", "return_sequences": false, "name": "lstm_2", "stateful": false, "W_regularizer": null, "dropout_U": 0.0}}, {"class_name": "Dense", "config": {"input_dim": 256, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 172, "activity_regularizer": null, "activation": "linear", "bias": true, "W_constraint": null, "trainable": true, "name": "dense_3", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_5"}}]}